RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sar.c
/***************************************************************************//**
* \file cy_sar.c
* \version 2.0.1
*
* Provides the public functions for the API for the SAR driver.
*
********************************************************************************
* \copyright
* Copyright 2017-2021 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/
#include "cy_sar.h"

#ifdef CY_IP_MXS40PASS_SAR

#if defined(__cplusplus)
extern "C" {
#endif

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 11.3', 81, \
'SAR_Type will typecast to either SAR_V1_Type or SAR_V2_Type but not both on PDL initialization based on the target device at compile time.');

#define CHAN_NUM(chan)           ((chan) < CY_SAR_NUM_CHANNELS)
#define IS_RIGHT_ALIGN           (!_FLD2BOOL(SAR_SAMPLE_CTRL_LEFT_ALIGN, SAR_SAMPLE_CTRL(base)))

#define CY_SAR_MASK                 (CY_SAR_SAR0 | \
                                     CY_SAR_SAR1 | \
                                     CY_SAR_SAR2 | \
                                     CY_SAR_SAR3)

#define IS_SAR_MASK_VALID(sarMask)  (0UL == ((sarMask) & ((uint32_t) ~CY_SAR_MASK)))
#define SCAN_CNT_MIN (1UL)
#define SCAN_CNT_MAX (256UL)
#define IS_SCAN_CNT_VALID(scanCnt) ((SCAN_CNT_MIN <= (scanCnt)) && ((scanCnt) <= SCAN_CNT_MAX))

#define CY_SAR_TR_IN_0          (0UL)
#define CY_SAR_TR_IN_1          (1UL)
#define CY_SAR_TR_IN_2          (2UL)
#define CY_SAR_TR_IN_3          (3UL)

static cy_stc_sar_state_backup_t enabledBeforeSleep[CY_SAR_INSTANCES] =
{
    {0UL,0UL},{0UL,0UL}
};

/* This array is used to calibrate the offset for each channel.
* At initialization, channels that are single-ended, signed, and with Vneg = Vref
* have an offset of -(2^12)/2 = -2048. All other channels have an offset of 0.
* The offset can be overridden using Cy_SAR_SetChannelOffset.
* The channel offsets are used by the Cy_SAR_CountsTo_Volts, Cy_SAR_CountsTo_mVolts, and
* Cy_SAR_CountsTo_uVolts functions to convert counts to voltage.
*/
volatile int16_t Cy_SAR_offset[CY_SAR_NUM_CHANNELS][CY_SAR_INSTANCES];

/* This array is used to calibrate the gain for each channel.
* It is set at initialization and the value depends on the SARADC resolution
* and voltage reference, 10*(2^12)/(2*Vref).
* The gain can be overridden using Cy_SAR_SetChannelGain.
* The channel gains are used by the Cy_SAR_CountsTo_Volts, Cy_SAR_CountsTo_mVolts and
* Cy_SAR_CountsTo_uVolts functions to convert counts to voltage.
*/
volatile int32_t Cy_SAR_countsPer10Volt[CY_SAR_NUM_CHANNELS][CY_SAR_INSTANCES];

/* Global variable to save internal states
 * bit 0 - fifo enable for SAR0 instance
 * bit 1 - fifo enable for SAR1 instance
 * */
static uint32_t Cy_SAR_flags = 0UL;


/*******************************************************************************
* Function Name: Cy_SAR_CommonInit
****************************************************************************//**
*
* Initialize common SAR configuration registers.
*
* \param base
* Pointer to structure describing PASS registers.
*
* \param trigConfig
* Pointer to structure containing configuration data.
* See \ref cy_stc_sar_common_config_t.
*
* \return
* - \ref CY_SAR_SUCCESS : initialization complete
* - \ref CY_SAR_BAD_PARAM : input pointers are null, initialization incomplete
*
* \funcusage
*
* \snippet sar/snippet/main.c SNIPPET_SAR_COMMON_INIT
*
*******************************************************************************/
cy_en_sar_status_t Cy_SAR_CommonInit(PASS_Type * base, const cy_stc_sar_common_config_t  * trigConfig)
{
    cy_en_sar_status_t result = CY_SAR_SUCCESS;

    if((!CY_PASS_V1) && (NULL != base) && (NULL != trigConfig))
    {
        uint32_t simultTrigSourceVal = CY_SAR_TR_IN_0;
        bool simultTrigTimer = false;
        uint32_t interruptState;

        CY_ASSERT_L3(IS_SAR_MASK_VALID(trigConfig->simultControl));
        CY_ASSERT_L3(IS_SCAN_CNT_VALID(trigConfig->scanCount));

        /* Convert and check simultTrigSource value */
        switch(trigConfig->simultTrigSource)
        {
        case CY_SAR_SAR0:
            simultTrigSourceVal = CY_SAR_TR_IN_0;
            break;

        case CY_SAR_SAR1:
            simultTrigSourceVal = CY_SAR_TR_IN_1;
            break;

        case CY_SAR_SAR2:
            simultTrigSourceVal = CY_SAR_TR_IN_2;
            break;

        case CY_SAR_SAR3:
            simultTrigSourceVal = CY_SAR_TR_IN_3;
            break;

        case CY_SAR_TIMER:
            simultTrigTimer = true;
            break;

        default:
            /* Incorrect trigger source */
            result = CY_SAR_BAD_PARAM;
            break;
        }

        if(CY_SAR_SUCCESS == result)
        {
            PASS_SAR_SIMULT_CTRL(base) = _VAL2FLD(PASS_V2_SAR_SIMULT_CTRL_SIMULT_HW_TR_EN, trigConfig->simultControl)                              |
                                         _VAL2FLD(PASS_V2_SAR_SIMULT_CTRL_SIMULT_HW_TR_SRC, simultTrigSourceVal)                                   |
                                        _BOOL2FLD(PASS_V2_SAR_SIMULT_CTRL_SIMULT_HW_TR_TIMER_SEL, simultTrigTimer)                                 |
                                         _VAL2FLD(PASS_V2_SAR_SIMULT_CTRL_SIMULT_HW_TR_LEVEL, (uint32_t)(trigConfig->simultTrigEvent))             |
                                         _VAL2FLD(PASS_V2_SAR_SIMULT_CTRL_SIMULT_HW_SYNC_TR, (uint32_t)(trigConfig->simultTrigSync))               |
                                         _VAL2FLD(PASS_V2_SAR_SIMULT_CTRL_SIMULT_TR_SCAN_CNT_SEL, (uint32_t)(trigConfig->simultSamplesPerTrigger)) |
                                         _VAL2FLD(PASS_V2_SAR_SIMULT_CTRL_SIMULT_EOS_INTR_SCAN_CNT_SEL, (uint32_t)(trigConfig->simultEOSIntrSelect));
            PASS_SAR_TR_SCAN_CNT(base) = _VAL2FLD(PASS_V2_SAR_TR_SCAN_CNT_SCAN_CNT, trigConfig->scanCount - 1UL);

