RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sar.c
            interruptState = Cy_SysLib_EnterCriticalSection();
            CY_REG32_CLR_SET(PASS_ANA_PWR_CFG(base), PASS_V2_ANA_PWR_CFG_PWR_UP_DELAY, trigConfig->pwrUpDelay);
            Cy_SysLib_ExitCriticalSection(interruptState);
        }
    }
    else
    {
        result = CY_SAR_BAD_PARAM;
    }

    return result;
}

/*******************************************************************************
* Function Name: Cy_SAR_Init
****************************************************************************//**
*
* Initialize all SAR configuration registers.
* If routing is to be configured, all switches will be cleared before
* being initialized.
*
* \note If interleaved averaging mode is used, the Differential Result Format
*       should be the same as the Single-Ended Result Format. Otherwise, this
*       function will return CY_SAR_BAD_PARAM.
*
* \param base
* Pointer to structure describing SAR instance registers
*
* \param config
* Pointer to structure containing configuration data. See \ref cy_stc_sar_config_t
* and guidance in the \ref group_sar_initialization section.
*
* \return
* - \ref CY_SAR_SUCCESS : initialization complete successfylly
* - \ref CY_SAR_BAD_PARAM : input pointers are null or some configuration
                            setting is invalid, initialization incomplete.
*
* \funcusage \snippet sar/snippet/main.c SNIPPET_SAR_INIT_CUSTOM
*
*******************************************************************************/
cy_en_sar_status_t Cy_SAR_Init(SAR_Type * base, const cy_stc_sar_config_t * config)
{
    cy_en_sar_status_t result = CY_SAR_BAD_PARAM;

    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != config);

    if ((NULL != base) && (NULL != config))
    {
        /* If interleaved averaging mode is used, the Differential Result Format should be the same as the Single-Ended Result Format. */
        if (((0UL != (config->sampleCtrl & SAR_V2_SAMPLE_CTRL_AVG_MODE_Msk)) ?
           !((0UL != (config->sampleCtrl & SAR_V2_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_Msk)) !=
             (0UL != (config->sampleCtrl & SAR_V2_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_Msk))) : true) &&
        /* The FIFO is supported by PASS_ver2 only */
            ((NULL != config->fifoCfgPtr) ? !CY_PASS_V1 : true) &&
        /* The Clock selection CY_SAR_CLK_DEEPSLEEP is allowed for PASS_V2 only */
            ((CY_SAR_CLK_DEEPSLEEP == config->clock) ? !CY_PASS_V1 : true))
        {
            uint32_t interruptState;
            uint8_t chan;
            bool vrefNegSelect;
            bool singleEndedSigned;
            bool chanSingleEnded;
            int32_t defaultGain;

            CY_ASSERT_L2(CY_SAR_CTRL(config->ctrl));
            CY_ASSERT_L2(CY_SAR_SAMPLE_CTRL(config->sampleCtrl));
            CY_ASSERT_L2(CY_SAR_SAMPLE_TIME(config->sampleTime01));
            CY_ASSERT_L2(CY_SAR_SAMPLE_TIME(config->sampleTime23));
            CY_ASSERT_L3(CY_SAR_RANGECOND(config->rangeCond));
            CY_ASSERT_L2(CY_SAR_INJMASK(config->chanEn));
            CY_ASSERT_L2(CY_SAR_INTRMASK(config->intrMask));
            CY_ASSERT_L2(CY_SAR_CHANMASK(config->satIntrMask));
            CY_ASSERT_L2(CY_SAR_CHANMASK(config->rangeIntrMask));

            /* Set the REFBUF_EN bit as this is required for proper operation. */
            SAR_CTRL(base) = (config->ctrl | SAR_CTRL_REFBUF_EN_Msk) & ~SAR_CTRL_ENABLED_Msk;
            SAR_SAMPLE_CTRL(base) = config->sampleCtrl | SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_Msk; /* Set the EOS_DSI_OUT_EN bit so the EOS signal can be routed */
            SAR_SAMPLE_TIME01(base) = config->sampleTime01;
            SAR_SAMPLE_TIME23(base) = config->sampleTime23;
            SAR_RANGE_THRES(base) = config->rangeThres;
            SAR_RANGE_COND(base) = (uint32_t)config->rangeCond << SAR_RANGE_COND_RANGE_COND_Pos;
            SAR_CHAN_EN(base) = _VAL2FLD(SAR_CHAN_EN_CHAN_EN, config->chanEn);

            /* Check whether NEG_SEL is set for VREF */
            vrefNegSelect = ((uint32_t)CY_SAR_NEG_SEL_VREF == (config->ctrl & SAR_CTRL_NEG_SEL_Msk))? true : false;
            /* Check whether single ended channels are set to signed */
            singleEndedSigned = (SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_Msk == (config->sampleCtrl & SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_Msk)) ? true : false;
            /* Calculate the default gain for all the channels in counts per 10 volts with rounding */
            defaultGain = (int32_t)(uint16_t)CY_SYSLIB_DIV_ROUND((uint32_t)CY_SAR_WRK_MAX_12BIT * (uint32_t)CY_SAR_10MV_COUNTS, config->vrefMvValue * 2UL);

            for (chan = 0u; chan < CY_SAR_SEQ_NUM_CHANNELS; chan++)
            {
                CY_ASSERT_L2(CY_SAR_CHAN_CONFIG(config->chanConfig[chan]));

                SAR_CHAN_CONFIG(base, chan) = config->chanConfig[chan];

                /* For signed single ended channels with NEG_SEL set to VREF,
                 * set the offset to minus half scale to convert results to unsigned format */
                chanSingleEnded = (0UL == (config->chanConfig[chan] & (SAR_CHAN_CONFIG_DIFFERENTIAL_EN_Msk | SAR_CHAN_CONFIG_NEG_ADDR_EN_Msk))) ? true : false;
                if (chanSingleEnded && vrefNegSelect && singleEndedSigned)
                {
                    Cy_SAR_offset[chan][CY_SAR_INSTANCE(base)] = (int16_t) (CY_SAR_WRK_MAX_12BIT / -2);
                }
                else
                {
                    Cy_SAR_offset[chan][CY_SAR_INSTANCE(base)] = 0;
                }

                Cy_SAR_countsPer10Volt[chan][CY_SAR_INSTANCE(base)] = defaultGain;
            }

            SAR_INTR_MASK(base) = config->intrMask;
            SAR_INTR(base) = config->intrMask;
            SAR_SATURATE_INTR_MASK(base) = config->satIntrMask;
            SAR_SATURATE_INTR(base) = config->satIntrMask;
            SAR_RANGE_INTR_MASK(base) = config->rangeIntrMask;
            SAR_RANGE_INTR(base) = config->rangeIntrMask;

            /* Set routing related registers if enabled */
            if (true == config->configRouting)
            {
                CY_ASSERT_L2(CY_SAR_SWITCHMASK(config->muxSwitch));
                CY_ASSERT_L2(CY_SAR_SQMASK(config->muxSwitchSqCtrl));

