RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sar.c
                /* Clear out all the switches so that only the desired switches in the config structure are set. */
                SAR_MUX_SWITCH_CLEAR0(base) = CY_SAR_CLEAR_ALL_SWITCHES;

                SAR_MUX_SWITCH0(base) = config->muxSwitch;
                SAR_MUX_SWITCH_SQ_CTRL(base) = config->muxSwitchSqCtrl;
            }

            /* Set the Cap trim if it was trimmed out of range from sflash */
            if ((CY_SAR_CAP_TRIM_MAX == SAR_ANA_TRIM0(base)) || (CY_SAR_CAP_TRIM_MIN == SAR_ANA_TRIM0(base)))
            {
                SAR_ANA_TRIM0(base) = CY_SAR_CAP_TRIM;
            }

            if (0UL != (CY_SAR_INJ_CHAN_MASK & config->chanEn))
            {
                SAR_INJ_CHAN_CONFIG(base) = config->chanConfig[CY_SAR_INJ_CHANNEL];
                Cy_SAR_countsPer10Volt[CY_SAR_INJ_CHANNEL][CY_SAR_INSTANCE(base)] = defaultGain;
            }

            if (NULL != config->fifoCfgPtr)
            {
                uint32_t locLevel = config->fifoCfgPtr->level - 1UL; /* Convert the user value into the machine value */

                Cy_SAR_flags |= CY_SAR_INSTANCE_MASK(base);

                PASS_FIFO_CONFIG(base) = _BOOL2FLD(PASS_FIFO_V2_CONFIG_CHAN_ID_EN,        config->fifoCfgPtr->chanId) |
                                         _BOOL2FLD(PASS_FIFO_V2_CONFIG_CHAIN_TO_NXT,      config->fifoCfgPtr->chainToNext) |
                                         _BOOL2FLD(PASS_FIFO_V2_CONFIG_TR_INTR_CLR_RD_EN, config->fifoCfgPtr->clrTrIntrOnRead);

                CY_ASSERT_L2(CY_SAR_IS_FIFO_LEVEL_VALID(locLevel));
                PASS_FIFO_LEVEL(base) = _VAL2FLD(PASS_FIFO_V2_LEVEL_LEVEL, locLevel);

                interruptState = Cy_SysLib_EnterCriticalSection();

                if (config->fifoCfgPtr->trOut)
                {
                    PASS_SAR_TR_OUT_CTRL(CY_PASS_V2_ADDR) |= CY_SAR_INSTANCE_MASK(base);
                }
                else
                {
                    PASS_SAR_TR_OUT_CTRL(CY_PASS_V2_ADDR) &= ~CY_SAR_INSTANCE_MASK(base);
                }

                Cy_SysLib_ExitCriticalSection(interruptState);
            }
            else
            {
                Cy_SAR_flags &= ~CY_SAR_INSTANCE_MASK(base);
            }

            if (!CY_PASS_V1)
            {
                uint32_t locReg;
                uint32_t locAndMask = ~(CY_SAR_INSTANCE_MASK(base) |
                                       (CY_SAR_INSTANCE_MASK(base) << PASS_V2_SAR_OVR_CTRL_TR_SCAN_CNT_SEL_Pos) |
                                       (CY_SAR_INSTANCE_MASK(base) << PASS_V2_SAR_OVR_CTRL_EOS_INTR_SCAN_CNT_SEL_Pos));
                uint32_t locOrMask = (config->trTimer ? CY_SAR_INSTANCE_MASK(base) : 0UL) |
                                     (config->scanCnt ? (CY_SAR_INSTANCE_MASK(base) << PASS_V2_SAR_OVR_CTRL_TR_SCAN_CNT_SEL_Pos) : 0UL) |
                                     (config->scanCntIntr ? (CY_SAR_INSTANCE_MASK(base) << PASS_V2_SAR_OVR_CTRL_EOS_INTR_SCAN_CNT_SEL_Pos) : 0UL);

                interruptState = Cy_SysLib_EnterCriticalSection();

                locReg = PASS_SAR_OVR_CTRL(CY_PASS_V2_ADDR);
                locReg &= locAndMask;
                locReg |= locOrMask;
                PASS_SAR_OVR_CTRL(CY_PASS_V2_ADDR) = locReg;

                Cy_SysLib_ExitCriticalSection(interruptState);

                CY_ASSERT_L3(CY_SAR_IS_CLK_VALID(config->clock));
                PASS_SAR_CLOCK_SEL(base) = _VAL2FLD(PASS_V2_SAR_CLOCK_SEL_CLOCK_SEL, config->clock);
                PASS_SAR_DPSLP_CTRL(base) = _BOOL2FLD(PASS_V2_SAR_DPSLP_CTRL_ENABLED, (CY_SAR_CLK_DEEPSLEEP == config->clock));
            }

            result = CY_SAR_SUCCESS;
        }
    }

    return result;
}


/*******************************************************************************
* Function Name: Cy_SAR_DeInit
****************************************************************************//**
*
* Reset SAR registers back to power on reset defaults.
*
* \if Cy_SAR_offset and Cy_SAR_countsPer10Volt arrays are NOT reset. \endif
*
* \param base
* Pointer to structure describing registers
*
* \param deInitRouting
* If true, all SARMUX switches are opened and switch control registers are reset
* to zero. If false, switch registers are untouched.
*
* \return
* - \ref CY_SAR_SUCCESS : de-initialization complete
* - \ref CY_SAR_BAD_PARAM : input pointers are null, de-initialization incomplete
*
* \funcusage
*
* \snippet sar/snippet/main.c SNIPPET_SAR_DEINIT
*
*******************************************************************************/
cy_en_sar_status_t Cy_SAR_DeInit(SAR_Type * base, bool deInitRouting)
{
    cy_en_sar_status_t result = CY_SAR_BAD_PARAM;

    CY_ASSERT_L1(NULL != base);

    if (NULL != base)
    {
        uint8_t chan;

        SAR_CTRL(base) = CY_SAR_DEINIT;
        SAR_SAMPLE_CTRL(base) = CY_SAR_DEINIT;
        SAR_SAMPLE_TIME01(base) = CY_SAR_SAMPLE_TIME_DEINIT;
        SAR_SAMPLE_TIME23(base) = CY_SAR_SAMPLE_TIME_DEINIT;
        SAR_RANGE_THRES(base) = CY_SAR_DEINIT;
        SAR_RANGE_COND(base) = CY_SAR_DEINIT;
        SAR_CHAN_EN(base) = CY_SAR_DEINIT;
        for (chan = 0u; chan < CY_SAR_SEQ_NUM_CHANNELS; chan++)
        {
            SAR_CHAN_CONFIG(base, chan) = CY_SAR_DEINIT;
        }
        SAR_INJ_CHAN_CONFIG(base) = CY_SAR_DEINIT;
        SAR_INTR_MASK(base) = CY_SAR_DEINIT;
        SAR_SATURATE_INTR_MASK(base) = CY_SAR_DEINIT;
        SAR_RANGE_INTR_MASK(base) = CY_SAR_DEINIT;
        if (true == deInitRouting)
        {
            SAR_MUX_SWITCH_CLEAR0(base) = CY_SAR_CLEAR_ALL_SWITCHES;
            SAR_MUX_SWITCH_DS_CTRL(base) = CY_SAR_DEINIT;
            SAR_MUX_SWITCH_SQ_CTRL(base) = CY_SAR_DEINIT;
        }

        if (!CY_PASS_V1)
        {
            uint32_t locAndMask = ~(CY_SAR_INSTANCE_MASK(base) |
                                    (CY_SAR_INSTANCE_MASK(base) << PASS_V2_SAR_OVR_CTRL_TR_SCAN_CNT_SEL_Pos) |
                                    (CY_SAR_INSTANCE_MASK(base) << PASS_V2_SAR_OVR_CTRL_EOS_INTR_SCAN_CNT_SEL_Pos));

            uint32_t interruptState = Cy_SysLib_EnterCriticalSection();

            PASS_SAR_OVR_CTRL(CY_PASS_V2_ADDR) &= locAndMask;
            PASS_SAR_TR_OUT_CTRL(CY_PASS_V2_ADDR) &= ~CY_SAR_INSTANCE_MASK(base);

            Cy_SysLib_ExitCriticalSection(interruptState);

            if (0UL != (Cy_SAR_flags & CY_SAR_INSTANCE_MASK(base)))
            {
                PASS_FIFO_CTRL(base) = CY_SAR_DEINIT; /* Disable first */
                PASS_FIFO_CONFIG(base) = CY_SAR_DEINIT;
                PASS_FIFO_LEVEL(base) = CY_SAR_DEINIT;
                Cy_SAR_flags &= ~CY_SAR_INSTANCE_MASK(base);
            }

            PASS_SAR_DPSLP_CTRL(base) = CY_SAR_DEINIT;
            PASS_SAR_CLOCK_SEL(base) = CY_SAR_DEINIT;
        }

        result = CY_SAR_SUCCESS;
    }

    return result;
}


